{
  "projects": [
    {
      "project_id": "PJT-001",
      "project_name": "Hospital Expansion",
      "role_access": ["Project Manager", "Project Engineer", "Superintendent"],
      "emails": [
        {
          "id": "EML-HOSP-001",
          "from": "john.martinez@steelco.com",
          "to": "sarah.chen@builder.com",
          "subject": "Structural Steel Delivery Delay - Week 4 Impact",
          "body": "Hi Sarah, I need to inform you that our structural steel shipment for the Hospital Expansion project has been delayed by approximately one week. The fabricator encountered quality issues during final inspection that required additional testing. We've resolved the issue, but this pushes our delivery date from October 28th to November 4th. This will impact the frame erection schedule for the new wing. I've attached the updated delivery schedule and quality certification documents. Please let me know how you'd like to proceed with adjusting the construction timeline. Best regards, John Martinez, Procurement Manager",
          "priority": "High",
          "due_date": "2025-11-01",
          "role_visibility": ["Project Manager", "Project Engineer"],
          "category": "",
          "summary": "",
          "action_required": ""
        },
        {
          "id": "EML-HOSP-002",
          "from": "architect@designassociates.com",
          "to": "sarah.chen@builder.com",
          "subject": "RFI #205 - Ceiling Type Specification for Patient Rooms",
          "body": "Good morning, I'm working on finalizing the ceiling details for the patient rooms in the new expansion wing. I need clarification on Spec Section 095123. The specification calls for a suspended acoustical ceiling system, but I notice in the construction documents that some areas show exposed structure. Can you confirm which ceiling type applies to the patient rooms on Level 2? Specifically, do we proceed with the suspended acoustical system as specified, or is there a design change? I need this confirmed by Friday to complete the interior elevations. Thank you, Michael Chen, Senior Architect",
          "priority": "Medium",
          "due_date": "2025-11-03",
          "role_visibility": ["Project Engineer", "Project Manager"],
          "category": "",
          "summary": "",
          "action_required": ""
        },
        {
          "id": "EML-HOSP-003",
          "from": "lisa.thompson@mepconsulting.com",
          "to": "david.rodriguez@builder.com",
          "subject": "HVAC Coordination Conflict - Ductwork vs. Structural Beam",
          "body": "David, I've identified a coordination issue on the third floor MEP routing. The main supply duct (24\" x 12\") for the ICU section conflicts with a structural beam that runs perpendicular to our duct route. The beam sits at 10' - 6\" AFF, and our duct needs 12\" clearance. The structural drawings show the beam depth as 16\", which doesn't leave adequate space. We have three options: 1) Route the duct around the beam (requires additional elbows and increases static pressure), 2) Lower the duct to 9' - 6\" AFF (violates code clearance requirements), or 3) Request structural modification to provide a pocket or notch. Please advise on the preferred solution. We need resolution by Monday to maintain schedule. Best regards, Lisa Thompson, MEP Lead",
          "priority": "High",
          "due_date": "2025-11-04",
          "role_visibility": ["Project Engineer", "Superintendent", "Project Manager"],
          "category": "",
          "summary": "",
          "action_required": ""
        },
        {
          "id": "EML-HOSP-004",
          "from": "procurement@builder.com",
          "to": "sarah.chen@builder.com",
          "subject": "Medical Equipment Delivery Schedule Update - MRI Suite",
          "body": "Sarah, I wanted to give you an update on the MRI equipment delivery. The manufacturer has confirmed that the equipment is ready for shipment, but they're requesting we push the delivery date by one week. The reason is they want to complete additional factory testing to ensure compatibility with the new shielding specifications we provided. The new delivery window is November 8-10 (previously November 1-3). This impacts the imaging suite completion timeline. The room prep work can continue as scheduled, but final installation and commissioning will be delayed. I've updated the master schedule document. Please review and let me know if we need to adjust any trade coordination. Regards, James Park, Procurement Coordinator",
          "priority": "High",
          "due_date": "2025-11-01",
          "role_visibility": ["Project Manager", "Project Engineer"],
          "category": "",
          "summary": "",
          "action_required": ""
        },
        {
          "id": "EML-HOSP-005",
          "from": "submittals@glazingvendor.com",
          "to": "david.rodriguez@builder.com",
          "subject": "Submittal Package - Curtain Wall System for New Wing",
          "body": "Hello David, Attached please find the complete submittal package for the curtain wall system as specified in Section 08410. This package includes: shop drawings (24 sheets), material data sheets for all aluminum extrusions and glazing, structural calculations, thermal performance data, and physical samples of finishes. We've also included the test reports from the independent lab for air infiltration, water penetration, and structural load testing. Please forward to the architect for review and approval. According to the contract, we require approval within 14 business days to maintain our fabrication schedule. The submittal reference number is CW-2025-08410-HOSP. Let me know if you need any additional information. Best regards, Patricia Wilson, Submittals Manager",
          "priority": "Medium",
          "due_date": "2025-11-06",
          "role_visibility": ["Project Engineer", "Project Manager"],
          "category": "",
          "summary": "",
          "action_required": ""
        },
        {
          "id": "EML-HOSP-006",
          "from": "inspector@citybuildingdept.gov",
          "to": "david.rodriguez@builder.com",
          "subject": "Building Inspection Schedule - Foundation and Framing",
          "body": "Mr. Rodriguez, This is to confirm the upcoming inspections for the Hospital Expansion project. We have scheduled the foundation inspection for Thursday, November 7th at 10:00 AM, and the structural framing inspection for Friday, November 8th at 2:00 PM. Please ensure all required documentation is on-site, including the foundation survey, structural calculations, and any applicable change orders. The site superintendent should be available to walk through both inspections. If there are any scheduling conflicts, please notify us at least 48 hours in advance. Inspection cards must be posted and accessible. Thank you, Robert Anderson, Building Inspector",
          "priority": "Medium",
          "due_date": "2025-11-07",
          "role_visibility": ["Superintendent", "Project Manager"],
          "category": "",
          "summary": "",
          "action_required": ""
        },
        {
          "id": "EML-HOSP-007",
          "from": "sarah.chen@builder.com",
          "to": "allteam@builder.com",
          "subject": "Weekly Progress Meeting Agenda - Week of Oct 28",
          "body": "Team, Our weekly progress meeting is scheduled for Wednesday, November 6th at 9:00 AM in the job trailer. Agenda items include: review of structural steel delivery delay and schedule impacts, discussion of HVAC coordination conflicts on Level 3, update on medical equipment delivery timeline, and review of pending submittals. Please come prepared with your action items and any concerns. We'll also review the updated master schedule reflecting the recent changes. Coffee and donuts will be provided. See you there, Sarah Chen, Project Manager",
          "priority": "Low",
          "due_date": "2025-11-06",
          "role_visibility": ["Project Manager", "Project Engineer", "Superintendent"],
          "category": "",
          "summary": "",
          "action_required": ""
        },
        {
          "id": "EML-HOSP-008",
          "from": "safety@builder.com",
          "to": "david.rodriguez@builder.com",
          "subject": "Safety Incident Report - Near Miss on Site",
          "body": "David, I need to report a near miss incident that occurred yesterday afternoon. While working on the third floor, a worker was positioning a piece of steel when a section of temporary guardrail came loose. Fortunately, no one was injured, but this highlights a safety concern. The guardrail was not properly secured during the last trade transition. I've conducted an inspection of all temporary fall protection on the site and identified three other locations that need immediate attention. Please ensure all trades conduct a safety walk before starting work in new areas. We'll hold a safety stand-down meeting this Friday at 7:00 AM. Regards, Mark Thompson, Site Safety Manager",
          "priority": "High",
          "due_date": "2025-10-31",
          "role_visibility": ["Superintendent", "Project Manager"],
          "category": "",
          "summary": "",
          "action_required": ""
        }
      ]
    },
    {
      "project_id": "PJT-002",
      "project_name": "Downtown Office Tower",
      "role_access": ["Project Manager", "Project Engineer", "Superintendent"],
      "emails": [
        {
          "id": "EML-TOWER-001",
          "from": "vendor@acmehvac.com",
          "to": "pm@builder.com",
          "subject": "Air Handling Unit Delivery Delay - Customs Clearance Issue",
          "body": "Good morning, I'm writing to inform you about a delay in the delivery of the two primary air handling units (AHU-1 and AHU-2) for the Downtown Office Tower project. The units are currently held at customs due to missing documentation for the imported components. We've been working with customs to resolve this, but it's taking longer than anticipated. The original delivery date was November 2nd, but we now anticipate delivery on November 5th - a delay of three business days. This may impact your MEP installation schedule. I've attached the updated shipping documentation. We're expediting the customs clearance process and will provide daily updates. Apologies for the inconvenience. Best regards, Jennifer Lee, Logistics Manager",
          "priority": "High",
          "due_date": "2025-11-01",
          "role_visibility": ["Project Engineer", "Project Manager"],
          "category": "",
          "summary": "",
          "action_required": ""
        },
        {
          "id": "EML-TOWER-002",
          "from": "architect@designfirm.com",
          "to": "pe@builder.com",
          "subject": "RFI #312 - Fire Door Rating Clarification for Corridor A",
          "body": "Hello, I need clarification regarding the fire door specifications in Corridor A on Level 15. The construction documents specify a 90-minute rated fire door assembly, but I've received product submittals that show 60-minute rated doors. Building code requires a 90-minute rating for this location based on occupancy separation. Can you confirm which rating is correct? If the submittals are incorrect, we'll need to reject them and request corrected documentation. Additionally, please verify that the selected door hardware is compatible with the required rating. I need this confirmed by November 4th to proceed with approval of the door submittal package. Thank you, Amanda Foster, Project Architect",
          "priority": "Medium",
          "due_date": "2025-11-04",
          "role_visibility": ["Project Engineer"],
          "category": "",
          "summary": "",
          "action_required": ""
        },
        {
          "id": "EML-TOWER-003",
          "from": "electrical@contractor.com",
          "to": "pm@builder.com",
          "subject": "Weekly Progress Update - Level 18 Electrical Rough-In Complete",
          "body": "Hi, Just wanted to provide a quick update on our electrical progress. We've completed the rough-in work for Level 18 this week, ahead of schedule. All branch circuits, panel feeds, and low voltage conduit are installed per the approved shop drawings. We've scheduled the electrical inspection with the city for Friday, November 1st at 2:00 PM. Assuming we pass, we'll proceed with Level 19 next week. Our team will also begin pulling wire for Level 17 as planned. Please let me know if you have any questions or concerns. Regards, Carlos Mendez, Electrical Superintendent",
          "priority": "Low",
          "due_date": "2025-10-31",
          "role_visibility": ["Superintendent", "Project Manager"],
          "category": "",
          "summary": "",
          "action_required": ""
        },
        {
          "id": "EML-TOWER-004",
          "from": "submittals@facadesystems.com",
          "to": "pe@builder.com",
          "subject": "Submittal Package - Curtain Wall System and Components",
          "body": "Hello, Please find attached the complete submittal package for the curtain wall system as specified in Sections 08410 and 08510. The package includes: detailed shop drawings (32 sheets), structural calculations signed and sealed by a licensed engineer, material test reports, thermal performance data, and finish samples. We've also included the proposed installation sequence and schedule. All components meet or exceed the specified performance criteria. Please distribute to the architect for review and approval. Our fabrication lead time is 8 weeks from approval, so timely review is critical to maintain the project schedule. Reference number: CW-DOT-2025-001. Best regards, Richard Kim, Technical Manager",
          "priority": "Medium",
          "due_date": "2025-11-06",
          "role_visibility": ["Project Engineer", "Project Manager"],
          "category": "",
          "summary": "",
          "action_required": ""
        },
        {
          "id": "EML-TOWER-005",
          "from": "steel@fabricator.com",
          "to": "pm@builder.com",
          "subject": "Elevator Shaft Steel Delay - Fabrication Issue",
          "body": "I need to inform you of a delay in the elevator shaft steel fabrication. During quality control inspection, we discovered that some of the steel plates for the elevator shaft on the east side don't meet the required thickness tolerance. This requires re-fabrication of 12 pieces. The delay will push delivery from November 5th to November 12th - approximately one week. I've discussed this with our production team and we're putting extra resources on this to minimize the delay. We're doing everything possible to get this back on track. I'll provide daily updates on the fabrication progress. Sorry for the inconvenience. Regards, Thomas Bradley, Fabrication Manager",
          "priority": "High",
          "due_date": "2025-11-05",
          "role_visibility": ["Project Manager", "Project Engineer"],
          "category": "",
          "summary": "",
          "action_required": ""
        },
        {
          "id": "EML-TOWER-006",
          "from": "pm@builder.com",
          "to": "client@developercorp.com",
          "subject": "Monthly Project Update - October 2025",
          "body": "Dear Client, I'm pleased to provide the monthly progress update for the Downtown Office Tower project. We've reached 65% overall completion, with structural work at 80%, MEP rough-in at 60%, and facade installation at 40%. Notable achievements this month include completion of Level 18 structural steel and successful installation of the main elevator equipment. We've encountered minor delays with elevator shaft steel fabrication (one week impact) and AHU delivery (three-day delay). These are being managed and won't impact the critical path. Attached is the detailed progress report and updated schedule. Our next milestone is completing Level 20 structural work by November 15th. Best regards, Project Management Team",
          "priority": "Medium",
          "due_date": "2025-11-05",
          "role_visibility": ["Project Manager"],
          "category": "",
          "summary": "",
          "action_required": ""
        },
        {
          "id": "EML-TOWER-007",
          "from": "mep@coordinator.com",
          "to": "pe@builder.com",
          "subject": "MEP Coordination Meeting - Ceiling Space Conflicts",
          "body": "Hi, We need to schedule a coordination meeting to resolve several conflicts in the ceiling plenum on Levels 16-18. The conflicts involve: HVAC ductwork interfering with sprinkler main lines, electrical conduit routing blocking access to air handling units, and plumbing lines conflicting with structural bracing. I've prepared conflict markups on the BIM model (see attached screenshots). We have three potential solutions, but we need input from all trades to determine the best approach. Can we schedule this for Friday, November 8th at 1:00 PM? Please confirm attendance from electrical, plumbing, fire protection, and structural. Thanks, Maria Santos, MEP Coordinator",
          "priority": "Medium",
          "due_date": "2025-11-08",
          "role_visibility": ["Project Engineer", "Superintendent", "Project Manager"],
          "category": "",
          "summary": "",
          "action_required": ""
        },
        {
          "id": "EML-TOWER-008",
          "from": "scheduler@builder.com",
          "to": "pm@builder.com",
          "subject": "Revised Schedule - November Critical Path Update",
          "body": "I've updated the master schedule to reflect the recent delays with elevator shaft steel and AHU delivery. The impact analysis shows that with the current delays, we can still meet the November 30th milestone for completing Level 20, but it requires accelerating work on Level 19. I've identified opportunities to compress the schedule by overlapping electrical and plumbing rough-in work. The updated schedule document is attached. Please review and let me know if you'd like to discuss schedule recovery options during our weekly meeting. The critical path remains the elevator core, and we're monitoring this closely. Best, Scheduling Team",
          "priority": "Medium",
          "due_date": "2025-11-07",
          "role_visibility": ["Project Manager", "Project Engineer"],
          "category": "",
          "summary": "",
          "action_required": ""
        }
      ]
    },
    {
      "project_id": "PJT-003",
      "project_name": "GreenTech HQ Renovation",
      "role_access": ["Project Manager", "Project Engineer"],
      "emails": [
        {
          "id": "EML-GT-001",
          "from": "sustainability@leedconsulting.com",
          "to": "pe@builder.com",
          "subject": "LEED Documentation Request - EPDs and Material Data",
          "body": "Hello, As part of the LEED v4.1 certification process for the GreenTech HQ Renovation, I need to collect Environmental Product Declarations (EPDs) and material composition data for the following products: flooring materials (carpet and vinyl), paint and coatings, and insulation materials. These documents are required for the Materials and Resources credit calculations. Please coordinate with your suppliers to obtain the EPDs. If EPDs are not available, we'll need alternative documentation or consider material substitutions that have certified EPDs. The deadline for LEED submission is November 20th, so I need these documents by November 10th to allow time for review and processing. Thank you, Dr. Emily Chang, LEED AP",
          "priority": "Medium",
          "due_date": "2025-11-10",
          "role_visibility": ["Project Engineer"],
          "category": "",
          "summary": "",
          "action_required": ""
        },
        {
          "id": "EML-GT-002",
          "from": "electrical@contractor.com",
          "to": "pm@builder.com",
          "subject": "Change in Lighting Fixture Availability - Discontinued Product",
          "body": "I need to inform you that the specified LED lighting fixtures (Model #LT-2045) have been discontinued by the manufacturer. We received notification from our supplier this morning. I've identified three alternative models that meet the same performance specifications (lumens, color temperature, dimming capability) and are available in similar pricing. Attached is a comparison sheet showing the specifications for each alternative. I recommend Model #LT-2156 as it's the closest match and is readily available. Please review and let me know which alternative you'd like to proceed with. If approved, I can submit this as a substitution request following your change order process. We need a decision by Friday to maintain the installation schedule. Best regards, Kevin Johnson, Electrical Contractor",
          "priority": "Low",
          "due_date": "2025-11-08",
          "role_visibility": ["Project Engineer", "Project Manager"],
          "category": "",
          "summary": "",
          "action_required": ""
        },
        {
          "id": "EML-GT-003",
          "from": "architect@eco-design.com",
          "to": "pe@builder.com",
          "subject": "RFI #78 - Window Replacement Energy Rating Verification",
          "body": "I'm reviewing the window submittals and need clarification on the energy performance ratings. The specifications call for windows with a U-factor of 0.30 or lower and Solar Heat Gain Coefficient (SHGC) of 0.40 or lower for LEED compliance. The submittal shows windows with U-factor 0.32 and SHGC 0.42. These don't meet the specified criteria. Can you confirm if these values are acceptable, or do we need to request windows that meet the original specification? If substitution is needed, we may need to adjust the project budget as these higher-performing windows tend to be more expensive. I need confirmation by November 5th to proceed with approval or rejection of the submittal. Thank you, Robert Martinez, Project Architect",
          "priority": "Medium",
          "due_date": "2025-11-05",
          "role_visibility": ["Project Engineer", "Project Manager"],
          "category": "",
          "summary": "",
          "action_required": ""
        },
        {
          "id": "EML-GT-004",
          "from": "supplier@flooringco.com",
          "to": "pm@builder.com",
          "subject": "Vinyl Flooring Installation Schedule Update",
          "body": "Hi, I wanted to update you on the vinyl flooring delivery and installation schedule. Our installation team has been delayed on another project, which pushes our start date by one week. Originally scheduled to begin November 4th, we're now looking at November 11th. The flooring materials are ready and will be delivered on November 8th as planned, but the installation crew won't be available until the following week. This delay shouldn't impact other trades since we're working in isolated areas. I've updated our schedule and will keep you informed if anything changes. Apologies for any inconvenience. Best, Lisa Chen, Installation Coordinator",
          "priority": "Low",
          "due_date": "2025-11-04",
          "role_visibility": ["Project Manager", "Superintendent"],
          "category": "",
          "summary": "",
          "action_required": ""
        },
        {
          "id": "EML-GT-005",
          "from": "mechanical@hvacpro.com",
          "to": "pe@builder.com",
          "subject": "Submittal Package - High-Efficiency HVAC System Components",
          "body": "Please find attached the complete submittal package for the high-efficiency HVAC system as specified in Section 230000. This package includes: equipment cut sheets for all units, certified performance data, installation and operation manuals, and warranty information. All equipment exceeds the minimum efficiency requirements specified (SEER 18+, EER 12+). We've also included the refrigerant selection documentation and the proposed control system integration details. The equipment is ready for order once approval is received. Lead time is 6 weeks from approval to delivery. Please distribute to the mechanical engineer for review. Reference: HVAC-GT-2025-001. Thank you, Michael Brown, Mechanical Contractor",
          "priority": "Medium",
          "due_date": "2025-11-07",
          "role_visibility": ["Project Engineer", "Project Manager"],
          "category": "",
          "summary": "",
          "action_required": ""
        },
        {
          "id": "EML-GT-006",
          "from": "pm@builder.com",
          "to": "client@greentech.com",
          "subject": "Project Status Update - Week of October 28",
          "body": "Hello Client Team, This week's progress update for the GreenTech HQ Renovation: We're at 45% overall completion. Electrical rough-in is 70% complete, HVAC installation is at 50%, and drywall work is beginning. We've encountered minor delays with flooring installation (one week push) and lighting fixture substitution (pending approval). Both issues are being managed and won't impact the overall project timeline. The LEED documentation collection is proceeding on schedule. We're on track to meet the November 30th milestone for completing all MEP rough-in work. Attached is the weekly progress report. As always, let me know if you have any questions. Best regards, Project Team",
          "priority": "Low",
          "due_date": "2025-11-03",
          "role_visibility": ["Project Manager"],
          "category": "",
          "summary": "",
          "action_required": ""
        },
        {
          "id": "EML-GT-007",
          "from": "drywall@contractor.com",
          "to": "superintendent@builder.com",
          "subject": "Coordination Needed - Ceiling Grid Layout vs. Light Fixtures",
          "body": "We've started the ceiling grid installation and noticed a conflict with the light fixture layout on the third floor. The proposed fixture locations don't align with our standard 2'x2' grid pattern. Some fixtures are landing on grid intersections instead of centered in the tiles. We need to either adjust the grid layout or relocate some fixtures. I've marked up the drawings showing both options. Can we schedule a quick coordination meeting to resolve this? It's impacting our progress and we'd like to get this sorted before we proceed further. I'm available Thursday or Friday this week. Thanks, Tony Rodriguez, Drywall Foreman",
          "priority": "Medium",
          "due_date": "2025-11-06",
          "role_visibility": ["Superintendent", "Project Engineer"],
          "category": "",
          "summary": "",
          "action_required": ""
        },
        {
          "id": "EML-GT-008",
          "from": "permits@city.gov",
          "to": "pm@builder.com",
          "subject": "Building Permit Inspection - Electrical and Plumbing Rough-In",
          "body": "This is to confirm the scheduled inspections for the GreenTech HQ Renovation project. Electrical rough-in inspection: Tuesday, November 5th at 9:00 AM. Plumbing rough-in inspection: Wednesday, November 6th at 10:00 AM. Please ensure all work is complete, properly labeled, and accessible. The electrical inspector will need access to all panels and junction boxes. The plumbing inspector will need to see all plumbing connections and verify code compliance. Both inspectors will need the approved plans and any change orders on-site. Please contact us immediately if there are any scheduling conflicts. Thank you, Permit Department",
          "priority": "Medium",
          "due_date": "2025-11-05",
          "role_visibility": ["Superintendent", "Project Manager"],
          "category": "",
          "summary": "",
          "action_required": ""
        }
      ]
    }
  ]
}
