[
  {
    "id": "19a56559d16e05cd",
    "from": "noreply-payments@google.com",
    "subject": "Action needed: Sign in to your account and take action",
    "date": "Wed, 05 Nov 2025 15:24:02 -0800",
    "snippet": "Safe & Secure We've noticed suspicious activity on your Google Account. Please go to your account and take the requested action within 3 days to avoid any service disruptions or the suspension",
    "body": "Safe & Secure We've noticed suspicious activity on your Google Account. Please go to your account and take the requested action within 3 days to avoid any service disruptions or the suspension of your Google payments profile. You'll need to upload: A scan of a government-issued photo ID that matches the billing name An image or scan of the payment method or a statement to confirm ownership For more information, visit the Google payments verification help page . Go to account Thank you, Google Support team You have received this mandatory email service announcement to update you about important changes to your Google Payments account. Learn more | Payments Centre | Help Centre | Privacy notice | How to recognise suspicious emails Google Payment Corp., P.O. Box 1568, Mountain View, CA 94042",
    "clean_status": "ok"
  },
  {
    "id": "19a56559c4edc31e",
    "from": "CloudPlatform-noreply@google.com",
    "subject": "Action required: Take action on your account to avoid service disruption.",
    "date": "Wed, 05 Nov 2025 15:24:02 -0800",
    "snippet": "Go to my console » Action required Dear Google customer, You are receiving this email because you are a Google Cloud Platform, Firebase or API customer. We've noticed suspicious activity on your",
    "body": "Go to my console » Action required Dear Google customer, You are receiving this email because you are a Google Cloud Platform, Firebase or API customer. We've noticed suspicious activity on your billing account 015182-B2B499-B12222. Your prompt action is required to avoid service disruption. To resolve this issue, please go to your account and take the requested actions here: https://console.cloud.google.com/billing/015182-B2B499-B12222 Failure to verify your payment information will lead to suspension of your billing account and associated projects. We sincerely apologise for any inconvenience that this may cause and we thank you for your cooperation during this process. The Google team © 2025 Google LLC, 1600 Amphitheatre Parkway, Mountain View, CA 94043 You have received this mandatory service announcement to update you about important changes to Google Cloud Platform, Firebase, APIs or to your account.",
    "clean_status": "ok"
  },
  {
    "id": "19a54e009130cf6d",
    "from": "chandru.subramani@techjays.com",
    "subject": "On-Schedule Delivery Confirmation – Structural Steel Beams for Skyline Tower",
    "date": "Wed, 5 Nov 2025 22:05:47 +0530",
    "snippet": "Dear Mike, We're pleased to confirm that the fabrication and dispatch schedule for 50 tons of structural steel beams for Skyline Tower remains on track. The materials are packed and ready for",
    "body": "Dear Mike, We’re pleased to confirm that the fabrication and dispatch schedule for 50 tons of structural steel beams for Skyline Tower remains on track. The materials are packed and ready for transport, with delivery expected as originally planned. Project: Skyline Tower Material: Structural Steel Beams Quantity: 50 Tons Status: Confirmed Delivery Date: 18-Nov-2025 Remarks: Shipment on schedule — transport arranged and expected to arrive on time. Thank you for your continued collaboration and trust. We appreciate your coordination in ensuring smooth project execution. Warm regards, Ahmed Raza Production Manager Steel Framing Inc.",
    "clean_status": "ok"
  },
  {
    "id": "19a5442383211f8a",
    "from": "chandru.subramani@techjays.com",
    "subject": "Urgent Update – Delivery Delay for Structural Steel Beams (Skyline Tower)",
    "date": "Wed, 5 Nov 2025 19:13:25 +0530",
    "snippet": "Dear Mike, We regret to inform you that the dispatch of 50 tons of structural steel beams for Skyline Tower has been delayed due to unexpected transportation issues. The logistics partner reported a",
    "body": "Dear Mike, We regret to inform you that the dispatch of 50 tons of structural steel beams for Skyline Tower has been delayed due to unexpected transportation issues. The logistics partner reported a mechanical fault in one of the carrier vehicles, resulting in a short delay. Project: Skyline Tower Material: Structural Steel Beams Quantity: 50 Tons Status: Delayed Remarks: Shipment rescheduled due to transport breakdown; revised delivery expected by 21-Nov-2025 . We apologize for the inconvenience and are working closely with our logistics team to ensure the materials reach the site at the earliest. Sincerely, Ahmed Raza Production Manager Steel Framing Inc.",
    "clean_status": "ok"
  },
  {
    "id": "19a543ffcb13de1d",
    "from": "chandru.subramani@techjays.com",
    "subject": "Delivery Confirmation – Structural Steel Beams for Skyline Tower",
    "date": "Wed, 5 Nov 2025 19:10:57 +0530",
    "snippet": "Dear Mike, We're pleased to inform you that the fabrication of 50 tons of structural steel beams for Skyline Tower has been successfully completed ahead of the revised schedule. All materials have",
    "body": "Dear Mike, We’re pleased to inform you that the fabrication of 50 tons of structural steel beams for Skyline Tower has been successfully completed ahead of the revised schedule. All materials have cleared quality checks and are now ready for dispatch. Project: Skyline Tower Material: Structural Steel Beams Quantity: 50 Tons Status: Confirmed Delivery Date: 18-Nov-2025 Remarks: Fabrication completed and shipment scheduled for tomorrow morning. Thank you for your patience and continued coordination. We appreciate your support throughout the process. Warm regards, Ahmed Raza Production Manager Steel Framing Inc.",
    "clean_status": "ok"
  },
  {
    "id": "19a54104dad0839d",
    "from": "chandru.subramani@techjays.com",
    "subject": "Fabrication Delay – Structural Steel Beams for Skyline Tower",
    "date": "Wed, 5 Nov 2025 18:18:52 +0530",
    "snippet": "Dear Mike, We regret to inform you that fabrication of 50 tons of structural steel beams for Skyline Tower has been delayed due to a shortage of raw steel sections. We are coordinating with our",
    "body": "Dear Mike, We regret to inform you that fabrication of 50 tons of structural steel beams for Skyline Tower has been delayed due to a shortage of raw steel sections. We are coordinating with our supplier and expect replenishment early next week. Project: Skyline Tower Material: Structural Steel Beams Quantity: 50 Tons Status: Delayed Remarks: Fabrication temporarily halted; revised delivery timeline to follow. We apologize for the inconvenience and will update you as soon as production resumes. Kind regards, Ahmed Raza Production Manager Steel Framing Inc.",
    "clean_status": "ok"
  },
  {
    "id": "19a540fb2a2ff3f6",
    "from": "chandru.subramani@techjays.com",
    "subject": "Production Complete – Glass Window Systems for Skyline Tower",
    "date": "Wed, 5 Nov 2025 18:18:14 +0530",
    "snippet": "Dear CARMA Construction Team, Production for the 100 glass window systems for Skyline Tower has been completed. We're currently arranging shipment documentation and expect to dispatch by 18-Nov-",
    "body": "Dear CARMA Construction Team, Production for the 100 glass window systems for Skyline Tower has been completed. We’re currently arranging shipment documentation and expect to dispatch by 18-Nov-2025. Project: Skyline Tower Material: Glass Window Systems Quantity: 100 Units Status: Confirmed Remarks: Awaiting final freight confirmation before shipment. Best regards, Emily Wong Project Coordinator GlassTech Suppliers",
    "clean_status": "ok"
  },
  {
    "id": "19a540eb0ce14121",
    "from": "chandru.subramani@techjays.com",
    "subject": "Pending Dispatch – Electrical Panels for Project Cascade",
    "date": "Wed, 5 Nov 2025 18:17:08 +0530",
    "snippet": "Dear CARMA Procurement Team, This is to inform you that shipment of 10 electrical panel sets for Project Cascade is still pending design approval from your engineering division. Once we receive the",
    "body": "Dear CARMA Procurement Team, This is to inform you that shipment of 10 electrical panel sets for Project Cascade is still pending design approval from your engineering division. Once we receive the approved drawings, we can dispatch the materials within 5 working days. Project: Project Cascade Material: Electrical Panels Quantity: 10 Sets Status: Pending Remarks: Awaiting final design approval before shipment. Sincerely, Jacob Miller Sales Engineer Electric Supply Co.",
    "clean_status": "ok"
  },
  {
    "id": "19a540e28e537ef1",
    "from": "chandru.subramani@techjays.com",
    "subject": "Delivery Confirmation – HVAC Ducts for Penthouse A",
    "date": "Wed, 5 Nov 2025 18:16:33 +0530",
    "snippet": "Dear CARMA Team, We're writing to confirm that 8 sets of HVAC ducts for Penthouse A have been successfully delivered to your site on schedule. Installation can begin as per your plan for next week.",
    "body": "Dear CARMA Team, We’re writing to confirm that 8 sets of HVAC ducts for Penthouse A have been successfully delivered to your site on schedule. Installation can begin as per your plan for next week. Project: Penthouse A Material: HVAC Ducts Quantity: 8 Sets Delivery Date: 10-Nov-2025 Status: Delivered Remarks: All items verified before dispatch. No pending quantities. Kind regards, Mariam Yusuf Logistics Coordinator Climate Control Systems",
    "clean_status": "ok"
  },
  {
    "id": "19a540da1281e25a",
    "from": "chandru.subramani@techjays.com",
    "subject": "Delivery Confirmation – Steel Frames for Penthouse A",
    "date": "Wed, 5 Nov 2025 18:15:58 +0530",
    "snippet": "Dear Chandru, We're pleased to inform you that 12 tons of structural steel frames for Penthouse A have been dispatched today. The shipment is expected to arrive at your site by 14-Nov-2025. Project",
    "body": "Dear Chandru, We’re pleased to inform you that 12 tons of structural steel frames for Penthouse A have been dispatched today. The shipment is expected to arrive at your site by 14-Nov-2025. Project: Penthouse A Material: Steel Frames Quantity: 12 Tons Status: Confirmed Remarks: Shipment left our warehouse today. Waybill will be shared shortly. Thank you for your continued coordination. Best regards, Ahmed Raza Dispatch Coordinator Steel Framing Inc.",
    "clean_status": "ok"
  }
]